<template>
    <div class="letter">
        <div class="canvasBox">
            <canvas ref="universe"></canvas>
        </div>
        <div class="pageContent">
            <div class="pageBox">
                <h1 class="title textOne">
                    亚洲巴菲特成也中国败也中国 因马云扬名立万 因滴滴华为跌下神坛
                </h1>
                <div class="articleInfo">
                    <span>作者: 听心</span>
                    <span>2019-08-01 12:12:01</span>
                </div>
                <div class="articleContent">
                    提起孙正义，不认识的人或许会认为他是个普通的中国人，略有了解的会认为他是一个日本人，但其实他是祖籍中国的韩裔日本富翁。孙正义16岁进入美国加州大学伯克利分校学习，在校期间就开始做生意，毕业时已经是身家几百万美元的富翁了。毕业后孙正义回到日本创建了软银集团，正式拉开了投资大享的序幕。
                    提起孙正义，不认识的人或许会认为他是个普通的中国人，略有了解的会认为他是一个日本人，但其实他是祖籍中国的韩裔日本富翁。孙正义16岁进入美国加州大学伯克利分校学习，在校期间就开始做生意，毕业时已经是身家几百万美元的富翁了。毕业后孙正义回到日本创建了软银集团，正式拉开了投资大享的序幕。
                    在国内，孙正义的名字通常与马云联系在一起，这是因为两人之间的一段投资佳话。20世纪90年代，互联网如火如荼的发展，孙正义先后投资了UT斯达康和雅虎并获得了成功，这坚定了孙正义投资互联网企业的信心。面对庞大的中国市场，孙正义也表露出了投资欲望，此时，UT斯达康创始人吴鹰把到处找投资的“小老弟”马云介绍给了孙正义。
                    马云与孙正义仅会面6分钟就敲定了投资计划，孙正义原本想要投资3000万美元获得阿里巴巴控股权，但在阿里巴巴CFO蔡崇信的坚持下，最终改为2000万美元获得40%的股权。随后阿里巴巴的发展让孙正义获得了巨额的回报。如今阿里巴巴的市值高达4000亿美元，经过不断减持后孙正义的软银集团仍持有阿里巴巴29.1%的股权，价值超过1000亿美元。因为这一系列的大胆又收益恐怖的投资，孙正义被称为“亚洲巴菲
                    dddddd提起孙正义，不认识的人或许会认为他是个普通的中国人，略有了解的会认为他是一个日本人，但其实他是祖籍中国的韩裔日本富翁。孙正义16岁进入美国加州大学伯克利分校学习，在校期间就开始做生意，毕业时已经是身家几百万美元的富翁了。毕业后孙正义回到日本创建了软银集团，正式拉开了投资大享的序幕。
                    在国内，孙正义的名字通常与马云联系在一起，这是因为两人之间的一段投资佳话。20世纪90年代，互联网如火如荼的发展，孙正义先后投资了UT斯达康和雅虎并获得了成功，这坚定了孙正义投资互联网企业的信心。面对庞大的中国市场，孙正义也表露出了投资欲望，此时，UT斯达康创始人吴鹰把到处找投资的“小老弟”马云介绍给了孙正义。
                    马云与孙正义仅会面6分钟就敲定了投资计划，孙正义原本想要投资3000万美元获得阿里巴巴控股权，但在阿里巴巴CFO蔡崇信的坚持下，最终改为2000万美元获得40%的股权。随后阿里巴巴的发展让孙正义获得了巨额的回报。如今阿里巴巴的市值高达4000亿美元，经过不断减持后孙正义的软银集团仍持有阿里巴巴29.1%的股权，价值超过1000亿美元。因为这一系列的大胆又收益恐怖的投资，孙正义被称为“亚洲巴菲
                    dddddd提起孙正义，不认识的人或许会认为他是个普通的中国人，略有了解的会认为他是一个日本人，但其实他是祖籍中国的韩裔日本富翁。孙正义16岁进入美国加州大学伯克利分校学习，在校期间就开始做生意，毕业时已经是身家几百万美元的富翁了。毕业后孙正义回到日本创建了软银集团，正式拉开了投资大享的序幕。
                    在国内，孙正义的名字通常与马云联系在一起，这是因为两人之间的一段投资佳话。20世纪90年代，互联网如火如荼的发展，孙正义先后投资了UT斯达康和雅虎并获得了成功，这坚定了孙正义投资互联网企业的信心。面对庞大的中国市场，孙正义也表露出了投资欲望，此时，UT斯达康创始人吴鹰把到处找投资的“小老弟”马云介绍给了孙正义。
                    马云与孙正义仅会面6分钟就敲定了投资计划，孙正义原本想要投资3000万美元获得阿里巴巴控股权，但在阿里巴巴CFO蔡崇信的坚持下，最终改为2000万美元获得40%的股权。随后阿里巴巴的发展让孙正义获得了巨额的回报。如今阿里巴巴的市值高达4000亿美元，经过不断减持后孙正义的软银集团仍持有阿里巴巴29.1%的股权，价值超过1000亿美元。因为这一系列的大胆又收益恐怖的投资，孙正义被称为“亚洲巴菲
                    dddddd提起孙正义，不认识的人或许会认为他是个普通的中国人，略有了解的会认为他是一个日本人，但其实他是祖籍中国的韩裔日本富翁。孙正义16岁进入美国加州大学伯克利分校学习，在校期间就开始做生意，毕业时已经是身家几百万美元的富翁了。毕业后孙正义回到日本创建了软银集团，正式拉开了投资大享的序幕。
                    在国内，孙正义的名字通常与马云联系在一起，这是因为两人之间的一段投资佳话。20世纪90年代，互联网如火如荼的发展，孙正义先后投资了UT斯达康和雅虎并获得了成功，这坚定了孙正义投资互联网企业的信心。面对庞大的中国市场，孙正义也表露出了投资欲望，此时，UT斯达康创始人吴鹰把到处找投资的“小老弟”马云介绍给了孙正义。
                    马云与孙正义仅会面6分钟就敲定了投资计划，孙正义原本想要投资3000万美元获得阿里巴巴控股权，但在阿里巴巴CFO蔡崇信的坚持下，最终改为2000万美元获得40%的股权。随后阿里巴巴的发展让孙正义获得了巨额的回报。如今阿里巴巴的市值高达4000亿美元，经过不断减持后孙正义的软银集团仍持有阿里巴巴29.1%的股权，价值超过1000亿美元。因为这一系列的大胆又收益恐怖的投资，孙正义被称为“亚洲巴菲
                    dddddd提起孙正义，不认识的人或许会认为他是个普通的中国人，略有了解的会认为他是一个日本人，但其实他是祖籍中国的韩裔日本富翁。孙正义16岁进入美国加州大学伯克利分校学习，在校期间就开始做生意，毕业时已经是身家几百万美元的富翁了。毕业后孙正义回到日本创建了软银集团，正式拉开了投资大享的序幕。
                    在国内，孙正义的名字通常与马云联系在一起，这是因为两人之间的一段投资佳话。20世纪90年代，互联网如火如荼的发展，孙正义先后投资了UT斯达康和雅虎并获得了成功，这坚定了孙正义投资互联网企业的信心。面对庞大的中国市场，孙正义也表露出了投资欲望，此时，UT斯达康创始人吴鹰把到处找投资的“小老弟”马云介绍给了孙正义。
                    马云与孙正义仅会面6分钟就敲定了投资计划，孙正义原本想要投资3000万美元获得阿里巴巴控股权，但在阿里巴巴CFO蔡崇信的坚持下，最终改为2000万美元获得40%的股权。随后阿里巴巴的发展让孙正义获得了巨额的回报。如今阿里巴巴的市值高达4000亿美元，经过不断减持后孙正义的软银集团仍持有阿里巴巴29.1%的股权，价值超过1000亿美元。因为这一系列的大胆又收益恐怖的投资，孙正义被称为“亚洲巴菲
                    dddddd提起孙正义，不认识的人或许会认为他是个普通的中国人，略有了解的会认为他是一个日本人，但其实他是祖籍中国的韩裔日本富翁。孙正义16岁进入美国加州大学伯克利分校学习，在校期间就开始做生意，毕业时已经是身家几百万美元的富翁了。毕业后孙正义回到日本创建了软银集团，正式拉开了投资大享的序幕。
                    在国内，孙正义的名字通常与马云联系在一起，这是因为两人之间的一段投资佳话。20世纪90年代，互联网如火如荼的发展，孙正义先后投资了UT斯达康和雅虎并获得了成功，这坚定了孙正义投资互联网企业的信心。面对庞大的中国市场，孙正义也表露出了投资欲望，此时，UT斯达康创始人吴鹰把到处找投资的“小老弟”马云介绍给了孙正义。
                    马云与孙正义仅会面6分钟就敲定了投资计划，孙正义原本想要投资3000万美元获得阿里巴巴控股权，但在阿里巴巴CFO蔡崇信的坚持下，最终改为2000万美元获得40%的股权。随后阿里巴巴的发展让孙正义获得了巨额的回报。如今阿里巴巴的市值高达4000亿美元，经过不断减持后孙正义的软银集团仍持有阿里巴巴29.1%的股权，价值超过1000亿美元。因为这一系列的大胆又收益恐怖的投资，孙正义被称为“亚洲巴菲
                    dddddd提起孙正义，不认识的人或许会认为他是个普通的中国人，略有了解的会认为他是一个日本人，但其实他是祖籍中国的韩裔日本富翁。孙正义16岁进入美国加州大学伯克利分校学习，在校期间就开始做生意，毕业时已经是身家几百万美元的富翁了。毕业后孙正义回到日本创建了软银集团，正式拉开了投资大享的序幕。
                    在国内，孙正义的名字通常与马云联系在一起，这是因为两人之间的一段投资佳话。20世纪90年代，互联网如火如荼的发展，孙正义先后投资了UT斯达康和雅虎并获得了成功，这坚定了孙正义投资互联网企业的信心。面对庞大的中国市场，孙正义也表露出了投资欲望，此时，UT斯达康创始人吴鹰把到处找投资的“小老弟”马云介绍给了孙正义。
                    马云与孙正义仅会面6分钟就敲定了投资计划，孙正义原本想要投资3000万美元获得阿里巴巴控股权，但在阿里巴巴CFO蔡崇信的坚持下，最终改为2000万美元获得40%的股权。随后阿里巴巴的发展让孙正义获得了巨额的回报。如今阿里巴巴的市值高达4000亿美元，经过不断减持后孙正义的软银集团仍持有阿里巴巴29.1%的股权，价值超过1000亿美元。因为这一系列的大胆又收益恐怖的投资，孙正义被称为“亚洲巴菲
                    dddddd提起孙正义，不认识的人或许会认为他是个普通的中国人，略有了解的会认为他是一个日本人，但其实他是祖籍中国的韩裔日本富翁。孙正义16岁进入美国加州大学伯克利分校学习，在校期间就开始做生意，毕业时已经是身家几百万美元的富翁了。毕业后孙正义回到日本创建了软银集团，正式拉开了投资大享的序幕。
                    在国内，孙正义的名字通常与马云联系在一起，这是因为两人之间的一段投资佳话。20世纪90年代，互联网如火如荼的发展，孙正义先后投资了UT斯达康和雅虎并获得了成功，这坚定了孙正义投资互联网企业的信心。面对庞大的中国市场，孙正义也表露出了投资欲望，此时，UT斯达康创始人吴鹰把到处找投资的“小老弟”马云介绍给了孙正义。
                    马云与孙正义仅会面6分钟就敲定了投资计划，孙正义原本想要投资3000万美元获得阿里巴巴控股权，但在阿里巴巴CFO蔡崇信的坚持下，最终改为2000万美元获得40%的股权。随后阿里巴巴的发展让孙正义获得了巨额的回报。如今阿里巴巴的市值高达4000亿美元，经过不断减持后孙正义的软银集团仍持有阿里巴巴29.1%的股权，价值超过1000亿美元。因为这一系列的大胆又收益恐怖的投资，孙正义被称为“亚洲巴菲
                    dddddd
                    在国内，孙正义的名字通常与马云联系在一起，这是因为两人之间的一段投资佳话。20世纪90年代，互联网如火如荼的发展，孙正义先后投资了UT斯达康和雅虎并获得了成功，这坚定了孙正义投资互联网企业的信心。面对庞大的中国市场，孙正义也表露出了投资欲望，此时，UT斯达康创始人吴鹰把到处找投资的“小老弟”马云介绍给了孙正义。


                    马云与孙正义仅会面6分钟就敲定了投资计划，孙正义原本想要投资3000万美元获得阿里巴巴控股权，但在阿里巴巴CFO蔡崇信的坚持下，最终改为2000万美元获得40%的股权。随后阿里巴巴的发展让孙正义获得了巨额的回报。如今阿里巴巴的市值高达4000亿美元，经过不断减持后孙正义的软银集团仍持有阿里巴巴29.1%的股权，价值超过1000亿美元。因为这一系列的大胆又收益恐怖的投资，孙正义被称为“亚洲巴菲
                    dddddd
                </div>
            </div>

        </div>
    </div>
</template>
<script>
    import {Star} from "./star.js";

    export default {
        name: "Letter",
        data() {
            return {
                starDensity: .216,
                speedCoeff: .05,
                width: 0,
                height: 0,
                starCount: 0,
                circleRadius: 0,
                circleCenter: {},
                universe: null,
                stars: [],

            }
        },
        mounted() {
            this.initPage();
            let that = this;
            window.onresize = function () {
                that.windowResizeHandler();
            }
        },
        methods: {
            initPage: function () {
                window.requestAnimationFrame = window.requestAnimationFrame || window.mozRequestAnimationFrame || window.webkitRequestAnimationFrame || window.msRequestAnimationFrame;
                //初始化
                this.windowResizeHandler();
                //创建对象
                this.createUniverse();
                //画出星星
                this.draw();
            },

            /**
             * 重窗口
             */
            windowResizeHandler: function () {
                let canva = this.$refs.universe;
                this.width = window.innerWidth;
                this.height = window.innerHeight;
                this.starCount = this.width * this.starDensity;
                this.circleRadius = (this.width > this.height ? this.height / 2 : this.width / 2);
                this.circleCenter = {
                    x: this.width / 2,
                    y: this.height / 2
                };
                canva.setAttribute('width', this.width);
                canva.setAttribute('height', this.height);
            },

            createUniverse: function () {
                this.universe = this.$refs.universe.getContext('2d');
                for (let i = 0; i < this.starCount; i++) {
                    this.stars[i] = new Star(this.universe, this.width, this.height);
                    this.stars[i].reset(this.width, this.height);
                }
            },
            draw: function () {
                this.universe.clearRect(0, 0, this.width, this.height);
                let starsLength = this.stars.length;
                for (let i = 0; i < starsLength; i++) {
                    let star = this.stars[i];
                    star.move(this.width, this.height);
                    star.fadeIn();
                    star.fadeOut(this.width, this.height);
                    star.draw();
                }
                window.requestAnimationFrame(this.draw);
            }
        }
    }
</script>

<style scoped lang="stylus">
    .letter
        .canvasBox
            min-height: 100%;
            position: fixed;
            top: 0;
            left: 0;
            right: 0;
            bottom: 0;
            background-image: radial-gradient(1600px at 70% 120%, rgba(33, 39, 80, 1) 10%, #020409 100%);

        .pageContent
            max-width: 1200px;
            margin: auto;
            position: relative;

            .pageBox
                margin: 10px;
                box-shadow: 0 0 12px #8a8a8a;
                overflow: hidden;
                margin-top: 20px;
                border-radius: 4px;
                background: #fff;

            .title
                margin-top: 0 auto;
                text-align: center;
                font-size 16px;
                padding: 10px 100px;

            .articleInfo
                text-align: center;

                span
                    margin: 0 10px;
                    display: inline-block;

            .articleContent
                padding: 20px;
                min-height: 500px;

</style>